
from NLPToolRequests import *

fileFolder = './'

sList = ["我反核", "我不支持核四", "我不是支持核四", "我沒有支持核四", "我沒有不支持核四", "我並非支持核四", "我沒有不同意核四興建"]
for s in sList:
    print(s)
    print(sendDepParseRequest(s, draw=True, fileFolder=fileFolder, fileName=s))

segList = ["我 反 核", "我 不 支持 核四", "我 不 是 支持 核四", "我 沒有 支持 核四", "我 沒有 不 支持 核四", "我 並非 支持 核四", "我 沒有 不 同意 核四 興建"]
for s in segList:
    print(s)
    print(sendDepParseRequest(s, seg=True, draw=True, fileFolder=fileFolder, fileName=s))


sList = ["我並不支持核四", 
         "我並非支持核四",
         "我並未支持核四",
         "我不支持核四",
         "我不必支持核四",
         "我不曾支持核四",
         "我不夠支持核四",
         "我不是支持核四",
         "我不要支持核四",
         "我從不支持核四",
         "我從來不支持核四",
         "我從未支持核四",
         "我毫不支持核四",
         "我絕不支持核四",
         "我決不支持核四",
         "我沒支持核四",
         "我沒有支持核四",
         "請勿支持核四",
         "我尚無支持核四",
         "我尚未支持核四",
         "我未曾支持核四",
         "我無需支持核四",
         "我無須支持核四",
         "你休想支持核四",
         "我永不支持核四",
         # double negation: using mei yu        
         "我並沒有不支持核四",
         "我並沒有未支持核四",
         "我沒有不支持核四",
         "我沒有不必支持核四",
         "我沒有不曾支持核四",
         "我沒有不夠支持核四",
         "我沒有不是支持核四",
         "我不是沒有支持核四",
         "我沒有不要支持核四",
         "我沒有從不支持核四",
         "我沒有從來不支持核四",
         "我沒有從未支持核四",
         "我沒有毫不支持核四",
         "我沒有絕不支持核四",
         "我沒有決不支持核四",
         "我沒有沒支持核四",
         "我沒有沒有支持核四",
         "我沒有尚無支持核四",
         "我沒有尚未支持核四",
         "我沒有未曾支持核四",
         "我沒有無需支持核四",
         "我沒有無須支持核四",
         "你休想不支持核四",
         "我沒有永不支持核四",
         # double negation using: bu si 
         "我並不是不支持核四",
         "我並不是未支持核四",
         "我不是不支持核四",
         "我不是不必支持核四",
         "我不是不曾支持核四",
         "我不是不夠支持核四",
         "我不是不是支持核四",
         "我不是不要支持核四",
         "我不是從不支持核四",
         "我不是從來不支持核四",
         "我不是從未支持核四",
         "我不是毫不支持核四",
         "我不是絕不支持核四",
         "我不是決不支持核四",
         "我不是沒支持核四",
         "我不是沒有支持核四",
         "我不是尚無支持核四",
         "我不是尚未支持核四",
         "我不是未曾支持核四",
         "我不是無需支持核四",
         "我不是無須支持核四",
         "我不是永不支持核四",
         ]

for s in sList:
    print(s)
    print(sendDepParseRequest(s, draw=True, fileFolder=fileFolder, fileName=s))
